<HTML>
<HEAD>
   <TITLE>Resume: Horn recursion for Schur P- and Q- functions</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF">
<TABLE>
 <TR>
  <TD> <img src="../talks/05/D.png"></TD>
  <td width=40></td>
  <td align=center>
   <FONT SIZE=+3 color=purple>
    <B>The Horn recursion for Schur <BR> <I>P</I>- and <I>Q</I>- functions</B></FONT><BR>
    <FONT SIZE=+2>Kevin Purbhoo <BR> and Frank Sottile</font><BR>
   </TD>
  <td width=40></td>
   <TD> <img src="../talks/05/C.png"></TD>
  </tr>
</table>
<!---------------------------------------------------------->

<P>
Une des cons&eacute;quences du travail de Klyachko et de Knutson-Tao est un
syst&egrave;me de r&eacute;currences de Horn pour d&eacute;terminer quand un coefficient
de Littlewood-Richardson est non nul. En bref, un tel coefficient est
non nul si et seulement si il satisfait une collection d'in&eacute;galit&eacute;s
de type Horn, dont les indices sont des coefficients de 
Littlewood-Richardson plus petits et non nuls.  Il existe des nombres de
Littlewood-Richardson comparables pour les <i>P</i>- et <i>Q</i>- fonctions de
Schur. En utilisant des outils provenant combinatoire des syst&egrave;mes de
racines, d'alg&egrave;bre lin&eacute;aire dans le contexte des alg&eacute;bre de Lie, 
et de la g&eacute;om&eacute;trie des vari&eacute;t&eacute;s de drapeaux cominiscules,  nous 
obtenons un syst&egrave;me de r&eacute;currences de type Horn pour d&eacute;terminer 
quand cette
famille de nombres de Littlewood-Richardson sont non nuls.  Ces
in&eacute;galit&eacute;s sont bas&eacute;es sur les nombres de Littlewood-Richardson
habituels, et m\^eme si les deux syst&egrave;mes sont tr&egrave;s diff&eacute;rents, ils 
ont la m\^eme solution. 
Une autre cons&eacute;quence de ce travail est une nouvelle
r&eacute;currence de type Horn pour les coefficients Littlewood-Richardson
habituels.

<BR><BR><HR><BR>

The manuscript in <A HREF="../ps/fpsac06.ps.gz">postscript</A>,
and in <A HREF="../pdf/fpsac06.pdf">pdf</A>.
<BR>
<A HREF="../publications.html#fpsac06"><IMG SRC="../abstracts/back.gif" ALT="Previous"></A>

</BODY> 
</HTML>
