
i1 : --The code in the following script is for computing examples in the paper "Bivariate Semi-algebraic Splines."
     --In the comments below all numbered Examples, Lemmas, etc. refer to the numbering in that paper.
     --If the user does not have Macaulay2 installed, it can be used at the website: http://habanero.math.cornell.edu:3690/
     --Copy and paste the commands below into the browser interface.
     
     --We will use the command `generalizedSplines' from the following package:
     loadPackage "AlgebraicSplines"

o1 = AlgebraicSplines

o1 : Package

i2 : --The documentation for this function may be found at:
     --http://www2.macaulay2.com/Macaulay2/doc/Macaulay2-1.15/share/doc/Macaulay2/AlgebraicSplines/html/_generalized__Splines.html
     --The command `generalizedSplines' computes the kernel of the map in Lemma 2.1
     
     -----------------------------------------------------------------------------------
     -----------------------------------------------------------------------------------
     ------Code for computing dimensions in Table 1, over the mesh in Figure 1----------
     -----------------------------------------------------------------------------------
     -----------------------------------------------------------------------------------
     
     ---Underlying polynonial ring has three variables (everything is homogenized)
     S=QQ[x,y,z]

o2 = S

o2 : PolynomialRing

i3 : 
     --This is a list of adjacent faces which intersect in an arc of the mesh in Figure 1
     --The faces are numbered as follows:
     --Top middle (purple): 0
     --Top right (pink): 1
     --Right middle (blue): 2
     --Bottom right (yellow): 3
     --Bottom middle (green): 4
     --Bottom left (pink): 5
     --Left middle (blue): 6
     --Top left (yellow): 7
     --The following list records arcs as intersections of faces corresponding
     --to the labels indicated above
     E={{0,1},{1,2},{2,3},{3,4},{4,5},{5,6},{6,7},{0,7},{0,4}};

i4 : 
     --The two parabolic equations in Figure 1
     f=y*z+x^2-z^2;--curve on top between two interior vertices

i5 : g=y*z-x^2+z^2;--curve on bottom between two interior vertices

i6 : 
     --The pairs in E are labeled by the edge form defining the arc along which the
     --corresponding faces intersect.  This is recorded in I below.
     --The first entry corresponds to {0,1}, the second to {1,2}, etc. (reading through
     --list of edges E defined above)
     I={f,g,f,g,g,f,g,f,y};

i7 : 
     --Create the module of semi-algebraic splines on the mesh in Figure 1--
     r=1--global smoothness parameter

o7 = 1

i8 : M=generalizedSplines(E,apply(I,h->h^(r+1)))

o8 = image | 1 0                           0                            x4+2x2yz-2x2z2+y2z2-2yz3+z4 -x4-2x2yz+2x2z2-y2z2+2yz3-z4 x4y+2x2y2z-2x2yz2+y3z2-2y2z3+yz4 x4y2+2x2y3z-2x2y2z2+y4z2-2y3z3+y2z4 x6-3x4z2-3x2y2z2-2y3z3+3x2z4+3y2z4-z6 0                                                  |
           | 1 x4+2x2yz-2x2z2+y2z2-2yz3+z4 -x4-2x2yz+2x2z2-y2z2+2yz3-z4 x4+2x2yz-2x2z2+y2z2-2yz3+z4 -x4-2x2yz+2x2z2-y2z2+2yz3-z4 0                                0                                   0                                     x8-4x6z2-2x4y2z2+6x4z4+4x2y2z4+y4z4-4x2z6-2y2z6+z8 |
           | 1 x4+2x2yz-2x2z2+y2z2-2yz3+z4 -4x2yz+4yz3                  4x2yz-4yz3                  -4x2yz+4yz3                  0                                0                                   0                                     0                                                  |
           | 1 0                           x4-2x2yz-2x2z2+y2z2+2yz3+z4  4x2yz-4yz3                  -4x2yz+4yz3                  0                                0                                   0                                     0                                                  |
           | 1 0                           0                            x4+2x2yz-2x2z2+y2z2-2yz3+z4 -x4-2x2yz+2x2z2-y2z2+2yz3-z4 x4y-2x2y2z-2x2yz2+y3z2+2y2z3+yz4 0                                   x6-3x4z2-3x2y2z2+2y3z3+3x2z4+3y2z4-z6 0                                                  |
           | 1 0                           0                            x4+2x2yz-2x2z2+y2z2-2yz3+z4 -4x2yz+4yz3                  0                                0                                   0                                     0                                                  |
           | 1 0                           0                            0                           x4-2x2yz-2x2z2+y2z2+2yz3+z4  0                                0                                   0                                     0                                                  |
           | 1 0                           0                            0                           0                            0                                0                                   0                                     0                                                  |

                             8
o8 : S-module, submodule of S

i9 : --compute the Hilbert polynomial of M
     hilbertPolynomial(M,Projective=>false)

       2
o9 = 4i  - 22i + 45

o9 : QQ[i]

i10 : 
      --Create Table 1:
      HEADER=join({"r\\d"},apply(14,i->i),{"Polynomial"})

o10 = {r\d, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, Polynomial}

o10 : List

i11 : --Copy and paste the following lines defining 'MIDDLEROWS' as a block
      MIDDLEROWS=apply(4,r->(
      	M=generalizedSplines(E,apply(I,h->h^(r+1)));
      	hp=hilbertPolynomial(M,Projective=>false);
      	join({r},apply(14,i->hilbertFunction(i,M)),{hp})
      	))

                                                                           2                                                                             2                                                                              2                                                                             2
o11 = {{0, 1, 3, 11, 26, 49, 80, 119, 166, 221, 284, 355, 434, 521, 616, 4i  - 5i + 5}, {1, 1, 3, 6, 10, 19, 34, 57, 87, 125, 171, 225, 287, 357, 435, 4i  - 22i + 45}, {2, 1, 3, 6, 10, 15, 21, 32, 48, 71, 102, 140, 185, 238, 299, 4i  - 39i + 130}, {3, 1, 3, 6, 10, 15, 21, 28, 36, 49, 67, 90, 120, 159, 205, 4i  - 56i + 258}}

o11 : List

i12 : BOTTOMROW=join({""},apply(14,i->hilbertFunction(i,S)),hilbertPolynomial(S,Projective=>false))

o12 = {, 1, 3, 6, 10, 15, 21, 28, 36, 45, 55, 66, 78, 91, 105, 1/2i2+3/2i+1}

o12 : List

i13 : --Execute the above three commands.  The next command will format these into Table 1.
      netList(join({HEADER},MIDDLEROWS,{BOTTOMROW}))

      +---+-+-+--+--+--+--+---+---+---+---+---+---+---+---+---------------+
o13 = |r\d|0|1|2 |3 |4 |5 |6  |7  |8  |9  |10 |11 |12 |13 |Polynomial     |
      +---+-+-+--+--+--+--+---+---+---+---+---+---+---+---+---------------+
      |   | | |  |  |  |  |   |   |   |   |   |   |   |   |  2            |
      |0  |1|3|11|26|49|80|119|166|221|284|355|434|521|616|4i  - 5i + 5   |
      +---+-+-+--+--+--+--+---+---+---+---+---+---+---+---+---------------+
      |   | | |  |  |  |  |   |   |   |   |   |   |   |   |  2            |
      |1  |1|3|6 |10|19|34|57 |87 |125|171|225|287|357|435|4i  - 22i + 45 |
      +---+-+-+--+--+--+--+---+---+---+---+---+---+---+---+---------------+
      |   | | |  |  |  |  |   |   |   |   |   |   |   |   |  2            |
      |2  |1|3|6 |10|15|21|32 |48 |71 |102|140|185|238|299|4i  - 39i + 130|
      +---+-+-+--+--+--+--+---+---+---+---+---+---+---+---+---------------+
      |   | | |  |  |  |  |   |   |   |   |   |   |   |   |  2            |
      |3  |1|3|6 |10|15|21|28 |36 |49 |67 |90 |120|159|205|4i  - 56i + 258|
      +---+-+-+--+--+--+--+---+---+---+---+---+---+---+---+---------------+
      |   |1|3|6 |10|15|21|28 |36 |45 |55 |66 |78 |91 |105|1/2i2+3/2i+1   |
      +---+-+-+--+--+--+--+---+---+---+---+---+---+---+---+---------------+

i14 : 
      -----------------------------------------------------------------------------------
      -----------------------------------------------------------------------------------
      ------Code for computations in Examples 3.1,3.5------------------------------------
      -----------------------------------------------------------------------------------
      -----------------------------------------------------------------------------------
      S=QQ[x,y,z];--coordinate ring for domain P^2

i15 : --the polynomials making the net in Example 3.1
      f=x^2-y*z; 

i16 : g=y^2-x*z; 

i17 : h=z^2+x*y;

i18 : N={f,g,h};

i19 : 
      R=QQ[u,v,w];--coordinate ring for codomain P^2

i20 : 
      --The pullback map of rings phi:R->S
      phi=map(S,R,N)

                2         2               2
o20 = map(S,R,{x  - y*z, y  - x*z, x*y + z })

o20 : RingMap S <--- R

i21 : 
      ----------------------------------------------------------------------
      ---Auxilliary function for computing edge forms in nets: Copy and past this entire block of code.
      ---Inputs: A net N, a list L of homogeneous coordinates of points in P^2
      ---Output: The (in most cases unique) form of N which passes through the points
      -------specified by L
      ----------------------------------------------------------------------
      edgeForm=(N,L)->(
          S := ring(first N);
          G := gens S;
          eval := apply(L,v->(
      	    apply(length N,i->(
      		    sub(N_i,apply(length G,j->(G_j=>v_j)))
      		    ))
      	    ));
          M = (matrix eval)||(matrix{N});
          det M
          )

o21 = edgeForm

o21 : FunctionClosure

i22 : ----------------------------------------------------------------------
      
      --Vertices for mesh Delta in Figure 3 (symmetric coordinates)
      V={{1,1,1},{1,2,1},{2,1,1},{3/11,2,1},{5/2,5/2,1},{2,3/11,1}};

i23 : --Slightly altered coordinates to yield non-symmetric Morgan-Scot mesh Delta'
      V'={{1,1,1},{1,2,1},{2,1,1},{3/11,2,1},{5/2,3,1},{2,3/11,1}};

i24 : 
      --pairs of indices of vertices connected by arcs in mesh Delta in Figure 3
      E={{1,3},{0,1},{0,2},{2,5},{1,2},{0,5},{0,3},{1,4},{2,4}};

i25 : 
      --Forms defining arcs of edges of mesh in Figure 3 (these are in the same order as
      --figure 3, but differ by constant multiple)
      I=apply(E,e->(edgeForm(N,V_e)))

         72 2   248      512 2   512      72      248 2      2     2                  2     2                512 2   248      72 2   72      512      248 2     2             2                     2  466 2   82 2   82      466       82 2   466 2   466      82     21 2           37 2   37      21         2    37 2           21 2   21      37         2
o25 = {- --x  + ---x*y - ---y  + ---x*z + --y*z + ---z , - 6x  - 2y  + 2x*z + 6y*z, 2x  + 6y  - 6x*z - 2y*z, ---x  - ---x*y + --y  - --x*z - ---y*z - ---z , 12x  - 8x*y + 12y  - 12x*z - 12y*z - 8z , ---x  + --y  - --x*z - ---y*z, - --x  - ---y  + ---x*z + --y*z, --x  - 15x*y + --y  - --x*z - --y*z - 15z , - --x  + 15x*y - --y  + --x*z + --y*z + 15z }
         11     121      121     121      11      121                                                        121     121      11     11      121      121                                              121     11     11      121       11     121     121      11      2              2      2       2               2              2      2       2

o25 : List

i26 : --Forms defining arcs of edges of non-symmetric Morgan Scot mesh in Figure 3
      I'=apply(E,e->(edgeForm(N,V'_e)))

         72 2   248      512 2   512      72      248 2      2     2                  2     2                512 2   248      72 2   72      512      248 2     2             2                     2  466 2   82 2   82      466       82 2   466 2   466      82       2   65      73 2   73             65 2       2   91      63 2   63              91 2
o26 = {- --x  + ---x*y - ---y  + ---x*z + --y*z + ---z , - 6x  - 2y  + 2x*z + 6y*z, 2x  + 6y  - 6x*z - 2y*z, ---x  - ---x*y + --y  - --x*z - ---y*z - ---z , 12x  - 8x*y + 12y  - 12x*z - 12y*z - 8z , ---x  + --y  - --x*z - ---y*z, - --x  - ---y  + ---x*z + --y*z, 6x  - --x*y + --y  - --x*z - 6y*z - --z , - 28x  + --x*y - --y  + --x*z + 28y*z + --z }
         11     121      121     121      11      121                                                        121     121      11     11      121      121                                              121     11     11      121       11     121     121      11            4       4      4              4              4       4      4               4

o26 : List

i27 : 
      --This is a list of adjacent faces which intersect in an arc of the mesh in Figure 3
      --The faces are numbered as follows:
      --(faces are described by their bounding arcs as labeled in Figure 3):
      --Face abg: 0
      --Face ak: 1
      --Face bce: 2
      --Face cdf: 3
      --Face dl: 4
      --Face ekl: 5
      --Face fg: 6
      --Ordering in DE matches ordering in E
      DE={{0,1},{0,2},{2,3},{3,4},{2,5},{3,6},{0,6},{1,5},{4,5}};

i28 : 
      --Compute Hilbert polynomial for C^1 splines on mesh in Example 3.5
      r=1;--global smoothness parameter

i29 : 
      --The pairs in E are labeled by the edge form defining the arc along which the
      --corresponding faces intersect.  This is recorded in L and L' below.
      --The first entry corresponds to {0,1}, the second to {0,2}, etc. (reading through
      --list of edges DE defined above)
      L=apply(I,f->f^(r+1));--edge labels for dual edges DE

i30 : L'=apply(I',f->f^(r+1));--edge labels for non-symmetric Morgan-Scot mesh

i31 : --The module of semi-algebraic splines on the mesh Delta in Figure 5.
      M=generalizedSplines(DE,L);

i32 : --The module of semi-algebraic splines on the non-symmetric Morgan-Scot mesh Delta'.
      M'=generalizedSplines(DE,L');

i33 : --The Hilbert polynomial below is P(d) in Example 3.5
      hilbertPolynomial(M,Projective=>false)

      7 2   51
o33 = -i  - --i + 61
      2      2

o33 : QQ[i]

i34 : hilbertPolynomial(M',Projective=>false)--Hilbert polynomial is the same for non-symmetric Morgan Scot

      7 2   51
o34 = -i  - --i + 61
      2      2

o34 : QQ[i]

i35 : 
      --The differences between the dimensions of C^1 splines on the meshes Delta' and Delta are visible in the
      --'Dimension' row of the tables below.  These rows appear in the lower table in Table 2.  The largest degree
      --in which the two rows of each table below disagree is the postulation number, underlined in the tables in
      --Table 2
      hilbertComparisonTable(0,10,M')

      +-----------+--+--+--+--+--+--+--+--+--+---+---+
o35 = |Degree     |0 |1 |2 |3 |4 |5 |6 |7 |8 |9  |10 |
      +-----------+--+--+--+--+--+--+--+--+--+---+---+
      |Dimension  |1 |3 |6 |10|15|21|34|54|81|115|156|
      +-----------+--+--+--+--+--+--+--+--+--+---+---+
      |HilbertPoly|61|39|24|16|15|21|34|54|81|115|156|
      +-----------+--+--+--+--+--+--+--+--+--+---+---+

i36 : hilbertComparisonTable(0,10,M)

      +-----------+--+--+--+--+--+--+--+--+--+---+---+
o36 = |Degree     |0 |1 |2 |3 |4 |5 |6 |7 |8 |9  |10 |
      +-----------+--+--+--+--+--+--+--+--+--+---+---+
      |Dimension  |1 |3 |6 |10|16|24|37|55|81|115|156|
      +-----------+--+--+--+--+--+--+--+--+--+---+---+
      |HilbertPoly|61|39|24|16|15|21|34|54|81|115|156|
      +-----------+--+--+--+--+--+--+--+--+--+---+---+

i37 : 
      --Compute vertices of Morgan-scott mesh obtained as phi(Delta) as shown in Figure 4, where Delta is the mesh
      --in Figure 5
      VMS=apply(V,v->apply(N,c->sub(c,{x=>v_0,y=>v_1,z=>v_2})))

                                             233  41  17    15  15  29    41    233  17
o37 = {{0, 0, 2}, {-1, 3, 3}, {3, -1, 3}, {- ---, --, --}, {--, --, --}, {--, - ---, --}}
                                             121  11  11     4   4   4    11    121  11

o37 : List

i38 : --Compute vertices of Morgan-scott mesh obtained as phi(Delta'), where Delta' is the non-symmetric
      --Morgan-Scot mesh
      VMS'=apply(V',v->apply(N,c->sub(c,{x=>v_0,y=>v_1,z=>v_2})))

                                             233  41  17    13  13  17    41    233  17
o38 = {{0, 0, 2}, {-1, 3, 3}, {3, -1, 3}, {- ---, --, --}, {--, --, --}, {--, - ---, --}}
                                             121  11  11     4   2   2    11    121  11

o38 : List

i39 : --compute splines on the mesh phi(Delta)
      R=QQ[u,v,w]

o39 = R

o39 : PolynomialRing

i40 : 
      --The linear forms which map to the edge forms of Delta under the pullback map
      IMS=apply(I,f->(
      	H = (vars R)*sub(first quotientRemainder(matrix{{f}},matrix{N}),R);
      	H_(0,0)
      	))

         72    512    248                       512    72    248                   466    82     82    466   21    37           37    21
o40 = {- --u - ---v + ---w, - 6u - 2v, 2u + 6v, ---u + --v - ---w, 12u + 12v - 8w, ---u + --v, - --u - ---v, --u + --v - 15w, - --u - --v + 15w}
         11    121    121                       121    11    121                   121    11     11    121    2     2            2     2

o40 : List

i41 : --The linear forms which map to the edge forms of Delta' under the pullback map
      IMS'=apply(I',f->(
      	H = (vars R)*sub(first quotientRemainder(matrix{{f}},matrix{N}),R);
      	H_(0,0)
      	))

         72    512    248                       512    72    248                   466    82     82    466        73    65           63    91
o41 = {- --u - ---v + ---w, - 6u - 2v, 2u + 6v, ---u + --v - ---w, 12u + 12v - 8w, ---u + --v, - --u - ---v, 6u + --v - --w, - 28u - --v + --w}
         11    121    121                       121    11    121                   121    11     11    121         4     4            4     4

o41 : List

i42 : 
      
      --The module of splines on phi(Delta), pictured in Figure 4
      r=1

o42 = 1

i43 : MS=generalizedSplines(DE,apply(IMS,f->f^(r+1)));

i44 : MS'=generalizedSplines(DE,apply(IMS',f->f^(r+1)));

i45 : --The Hilbert polynomial below is P_phi(d) in Example 3.5
      hilbertPolynomial(MS,Projective=>false)

      7 2   15
o45 = -i  - --i + 7
      2      2

o45 : QQ[i]

i46 : hilbertPolynomial(MS',Projective=>false)

      7 2   15
o46 = -i  - --i + 7
      2      2

o46 : QQ[i]

i47 : 
      --The differences between the dimensions of C^1 splines on the meshes Delta' and Delta are visible in the
      --'Dimension' row of the tables below.  These rows appear in the upper table in Table 2.  The largest degree
      --in which the two rows of each table below disagree is the postulation number, underlined in the tables in
      --Table 2
      hilbertComparisonTable(0,10,MS')

      +-----------+-+-+-+--+--+--+--+---+---+---+---+
o47 = |Degree     |0|1|2|3 |4 |5 |6 |7  |8  |9  |10 |
      +-----------+-+-+-+--+--+--+--+---+---+---+---+
      |Dimension  |1|3|6|16|33|57|88|126|171|223|282|
      +-----------+-+-+-+--+--+--+--+---+---+---+---+
      |HilbertPoly|7|3|6|16|33|57|88|126|171|223|282|
      +-----------+-+-+-+--+--+--+--+---+---+---+---+

i48 : hilbertComparisonTable(0,10,MS)

      +-----------+-+-+-+--+--+--+--+---+---+---+---+
o48 = |Degree     |0|1|2|3 |4 |5 |6 |7  |8  |9  |10 |
      +-----------+-+-+-+--+--+--+--+---+---+---+---+
      |Dimension  |1|3|7|16|33|57|88|126|171|223|282|
      +-----------+-+-+-+--+--+--+--+---+---+---+---+
      |HilbertPoly|7|3|6|16|33|57|88|126|171|223|282|
      +-----------+-+-+-+--+--+--+--+---+---+---+---+

i49 : 
      -----------------------------------------------------------------------------------
      -----------------------------------------------------------------------------------
      ------Code for computations in Example 4.12----------------------------------------
      -----------------------------------------------------------------------------------
      -----------------------------------------------------------------------------------
      ---Underlying polynonial ring has three variables (everything is homogenized)
      S=QQ[x,y,z]

o49 = S

o49 : PolynomialRing

i50 : 
      --This is a list of adjacent faces which intersect in an arc of the mesh in Figure 7
      --The faces are numbered as follows:
      --Top middle (purple): 0
      --Top right (pink): 1
      --Right middle (blue): 2
      --Bottom right (yellow): 3
      --Bottom middle (green): 4
      --Bottom left (pink): 5
      --Left middle (blue): 6
      --Top left (yellow): 7
      --The following list records arcs as intersections of faces corresponding
      --to the labels indicated above
      E={{0,1},{1,2},{2,3},{3,4},{4,5},{5,6},{6,7},{0,7},{0,4}};

i51 : 
      --Arcs encoded in E are labeled according to choices in Example 4.12.
      I={y*z+(-x+z)*(-x+2*z),-2*x+y+2*z,-2*x-y+2*z,-y*z+(-x+z)*(-x+2*z),-y*z+(x+z)*(x+2*z),2*x-y+2*z,2*x+y+2*z,y*z+(x+z)*(x+2*z),y};

i52 : 
      --Create the module of semi-algebraic splines on the mesh in Figure 7--
      r=1--global smoothness parameter

o52 = 1

i53 : M=generalizedSplines(E,apply(I,h->h^(r+1)));

i54 : --compute the Hilbert polynomial of M
      hilbertPolynomial(M,Projective=>false)

        2
o54 = 4i  - 14i + 17

o54 : QQ[i]

i55 : 
      --Create Table 3:
      HEADER=join({"r\\d"},apply(12,i->i),{"Polynomial"})

o55 = {r\d, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, Polynomial}

o55 : List

i56 : --Copy and paste the following lines defining 'MIDDLEROWS' as a block
      MIDDLEROWS=apply(5,r->(
      	M=generalizedSplines(E,apply(I,h->h^(r+1)));
      	hp=hilbertPolynomial(M,Projective=>false);
      	join({r},apply(12,i->hilbertFunction(i,M)),{hp})
      	))

                                                                 2                                                                   2                                                                    2                                                                   2                                                                   2
o56 = {{0, 1, 4, 15, 34, 61, 96, 139, 190, 249, 316, 391, 474, 4i  - i + 1}, {1, 1, 3, 6, 11, 25, 47, 77, 115, 161, 215, 277, 347, 4i  - 14i + 17}, {2, 1, 3, 6, 10, 15, 23, 38, 63, 96, 137, 186, 243, 4i  - 27i + 56}, {3, 1, 3, 6, 10, 15, 21, 28, 38, 54, 82, 118, 162, 4i  - 40i + 118}, {4, 1, 3, 6, 10, 15, 21, 28, 36, 45, 58, 77, 106, 4i  - 53i + 205}}

o56 : List

i57 : --Execute the above three commands.  The next command will format these into Table 4.
      netList(join({HEADER},MIDDLEROWS))
      
      +---+-+-+--+--+--+--+---+---+---+---+---+---+---------------+
o57 = |r\d|0|1|2 |3 |4 |5 |6  |7  |8  |9  |10 |11 |Polynomial     |
      +---+-+-+--+--+--+--+---+---+---+---+---+---+---------------+
      |   | | |  |  |  |  |   |   |   |   |   |   |  2            |
      |0  |1|4|15|34|61|96|139|190|249|316|391|474|4i  - i + 1    |
      +---+-+-+--+--+--+--+---+---+---+---+---+---+---------------+
      |   | | |  |  |  |  |   |   |   |   |   |   |  2            |
      |1  |1|3|6 |11|25|47|77 |115|161|215|277|347|4i  - 14i + 17 |
      +---+-+-+--+--+--+--+---+---+---+---+---+---+---------------+
      |   | | |  |  |  |  |   |   |   |   |   |   |  2            |
      |2  |1|3|6 |10|15|23|38 |63 |96 |137|186|243|4i  - 27i + 56 |
      +---+-+-+--+--+--+--+---+---+---+---+---+---+---------------+
      |   | | |  |  |  |  |   |   |   |   |   |   |  2            |
      |3  |1|3|6 |10|15|21|28 |38 |54 |82 |118|162|4i  - 40i + 118|
      +---+-+-+--+--+--+--+---+---+---+---+---+---+---------------+
      |   | | |  |  |  |  |   |   |   |   |   |   |  2            |
      |4  |1|3|6 |10|15|21|28 |36 |45 |58 |77 |106|4i  - 53i + 205|
      +---+-+-+--+--+--+--+---+---+---+---+---+---+---------------+
