
i1 : -- counterexample to containment for r=5 --
     -- Currently Remark 11, but that may change --
     S=QQ[x,y,z]

o1 = S

o1 : PolynomialRing

i2 : f=x*z+x^2+x*y+y^2;

i3 : g=y*z+x^2+x*y+2*y^2;

i4 : h=x*z+y*z+x^2+x*y+3*y^2;

i5 : r=5;

i6 : I=ideal(f^r,g^r,h^r);

o6 : Ideal of S

i7 : --to ensure that saturate(I)==saturate(I,z), check that radical(I)=ideal(x,y)--
     radical(I)==ideal(x,y)

o7 = true

i8 : --the following code, when executed, gives a table listing:
     --1. The power r to which f,g,h are raised
     --2. The degrees of the resulting schemes I and J
     --3. Whether I is contained in J
     --4. Whether the saturation of I is equal to J 
     netList apply(toList(1..5),r->(
     	I=ideal(f^r,g^r,h^r);
             J=ideal(x^r,y^r,(x+y)^r);
     	{concatenate("r=",toString(r)),concatenate("Deg(I)=",toString(hilbertPolynomial(I,Projective=>false))),concatenate("Deg(J)=",toString(hilbertPolynomial(J,Projective=>false))),concatenate("I subset J? ",toString(isSubset(I,J))),concatenate("I:m^infty=J? ",toString(J==saturate(I,z)))}
     	))

     +---+---------+---------+-----------------+------------------+
o8 = |r=1|Deg(I)=1 |Deg(J)=1 |I subset J? true |I:m^infty=J? true |
     +---+---------+---------+-----------------+------------------+
     |r=2|Deg(I)=3 |Deg(J)=3 |I subset J? true |I:m^infty=J? true |
     +---+---------+---------+-----------------+------------------+
     |r=3|Deg(I)=7 |Deg(J)=7 |I subset J? true |I:m^infty=J? true |
     +---+---------+---------+-----------------+------------------+
     |r=4|Deg(I)=12|Deg(J)=12|I subset J? true |I:m^infty=J? true |
     +---+---------+---------+-----------------+------------------+
     |r=5|Deg(I)=19|Deg(J)=19|I subset J? false|I:m^infty=J? false|
     +---+---------+---------+-----------------+------------------+

i9 : 
     
